[
  {
    "org": "FRC 604: Quixilver Robotics",
    "position": "Controls Lead (10-11)",
    "startMonth": "June 2022",
    "endMonth": "September 2024",
    "ongoing": true,
    "details": [
      {
        "point": "Maintain and contribute to team's Particle Filter, Holonomic Time Optimized Autonomous Path Planner, Yearly Robot Control Software based on yearly needs."
      },
      {
        "point": "Utilize computer vision and environmental sensors (color, beam break, optical, etc.) to enhance robot capabilities, navigation, and autonomous capabilities."
      },
      {
        "point": "Direct development and maintainance of novel application to efficiently collect and insightfully visualize high volumes of competition data, enhancing strategic decision-making and competitive performance."
      },
      {
        "point": "Contribute to and utilize ubiquitous FRC tools: TheBlueAlliance, a data insight platform encompassing data from all global FRC events, and WPILIB, a comprehensive framework for robot development and control"
      },
      {
        "point": "Lead subteams in design, manufacturing, and programming of team robot and train new members to contribute to robot development."
      },
      {
        "point": "4th ranked team in California, 12th out of 9000+ total teams; World Championship Division and Two California Regional Event Winning Team (2024)"
      }
    ],
    "icon": {
      "src": "src/static/icons/frc604.jpeg",
      "link": "https://604robotics.com/"
    },
    "hide": false
  },
  {
    "org": "UCLA COSMOS",
    "position": "2024 AI Cohort Student",
    "startMonth": "July 2022",
    "endMonth": "August 2024",
    "ongoing": false,
    "details": [
      {
        "point": "Highly selective 4 week UCLA Neurology and AI Summer Program (<4.6% acceptance rate.)"
      },
      {
        "point": "Started program without any prior knowledge, created and optimized numerous architectures (Synaptic Integration, MLPs, CNNs, AlexNet, VAEs, RL Model) for given use cases."
      },
      {
        "point": "Rapidly developed comprehensive understanding of fundamenal machine learning principles: transformers, recurrent networks, advanced regression, reinforcement learning, convolutional models, advanced training optimization."
      }
    ],
    "icon": {
      "src": "src/static/icons/cosmos.jpg",
      "link": "https://cosmos.ucla.edu/"
    },
    "hide": false
  }
]
