[
  {
    "org": "FRC 604: Quixilver Robotics",
    "position": "Controls/Software Lead (10-11)",
    "startYear": "2022",
    "endYear": "2024",
    "ongoing": true,
    "details": [
      {
        "point": "Enhanced robot capabilities with computer vision and sensor integration, contributed to SOTA team software (particle filter localizer, time-optimal trajectory optimizer, annual robot control architecture). Developed team's competition data collection application Quickscout."
      },
      {
        "point": "Developed a progressive web app for TheBlueAlliance, modernizing the univerally used platform and providing comprehensive, real-time access to all competition and team data over 30+ years."
      },
      {
        "point": "Led subteams in design, manufacturing, and programming of FRC team robot while teaching new members about robot development."
      }
    ],
    "icon": {
      "src": "/static/icons/frc604.jpeg",
      "link": "https://604robotics.com/"
    },
    "hideOnSite": false,
    "hideOnResume": false
  },
  {
    "org": "UCLA COSMOS (CA Summer School for Mathematics & Science)",
    "position": "Brain-Inspired Computing Cohort Member",
    "startYear": "2024",
    "endYear": "2024",
    "ongoing": false,
    "details": [
      {
        "point": "Conducted deep analyses of the computational principles and neurological correlations of 20+ key machine learning mechanisms (attention, visual processing, recurrent systems, reinforcement, etc), gaining a comprehensive understanding of their capabilities and limitations."
      },
      {
        "point": "Developed StereoSampleGAN with UCLA funding to generate high quality stereo audio samples with a 99.77% reduction in training epoch count compared to monophonic audio generation model SpecGAN."
      }
    ],
    "icon": {
      "src": "/static/icons/cosmos.jpg",
      "link": "https://cosmos.ucla.edu/"
    },
    "hideOnSite": false,
    "hideOnResume": false
  },
  {
    "org": "Bay Area STEM Academy",
    "position": "Cofounder",
    "startYear": "2023",
    "endYear": "2024",
    "ongoing": true,
    "details": [
      {
        "point": "Taught 700+ elementary to high school students diverse STEM topics via numerous in-person and online workshops covering Robotics, Engineering, Machine Learning, and Programming Fundamentals."
      },
      {
        "point": "Raised $6000+ to support local STEM outreach initiatives for underrepresented communities and children health foundations, recruited 15+ academy mentors."
      }
    ],
    "icon": {
      "src": "/static/icons/basa.jpeg",
      "link": "https://bayareastemacademy.net/"
    },
    "hideOnSite": false,
    "hideOnResume": false
  },
  {
    "org": "Leland Speech and Debate (NSDA)",
    "position": "Varsity Speaker",
    "startYear": "2022",
    "endYear": "2024",
    "ongoing": true,
    "details": [
      {
        "point": "Refine argumentation skills and rapidly synthesize speeches to compete on an international level."
      },
      {
        "point": "Competed in 20+ tournaments as member of 3/3550+ ranked NSDA program."
      }
    ],
    "icon": {
      "src": "/static/icons/lsd.jpg",
      "link": "https://www.lelandsd.org/"
    },
    "hideOnSite": true,
    "hideOnResume": true
  }
]
